{
    "HEADER": "कार्य अनुभव",
    "SKILLS_USED": "प्रयुक्त कौशल",
    "WFX_INTERN": {
        "TITLE": "सॉफ्टवेयर इंजीनियर इंटर्न",
        "COMPANY": "व्हाटफिक्स इंटर्न",
        "LOGO": "/whatfix-logo.png",
        "TECHSTACK": [
            "जावा",
            "टाइपस्क्रिप्ट",
            "इलास्टिक-सर्च",
            "कैसेंड्रा",
            "ओपनएआई",
            "हैडूप"
        ],
        "START_DATE": "जनवरी 2024",
        "END_DATE": "जून 2024",
        "DESCRIPTION": "• एक हाइब्रिड डेस्कटॉप एप्लिकेशन के लिए शुरू से एक मजबूत UI टेस्टिंग फ्रेमवर्क डिज़ाइन और विकसित किया। यह नोड-आधारित फ्रेमवर्क वेब, हाइब्रिड, और नेटिव डेस्कटॉप एप्लिकेशन को मैक और विंडोज प्लेटफॉर्म पर टेस्ट करने में सक्षम है। मैंने टेस्ट केसों के पुन: उपयोग को सुविधाजनक बनाने के लिए पतले इंटरफेस को लागू किया, जो हमारे टेस्टएनजी-आधारित जावा प्रोग्राम में लिखे गए हैं, जिससे सीमलेस इंटीग्रेशन और ठोस IPC का उपयोग करके कुशल टेस्टिंग प्रक्रियाओं को सुनिश्चित किया जा सके।\n• सॉफ्टवेयर डिज़ाइन चर्चाओं में सक्रिय रूप से भाग लिया, जिससे मेरी और अन्य टीम सदस्यों की परियोजनाओं की वास्तुकला योजना में योगदान दिया गया। इस भागीदारी ने मेरी सॉफ्टवेयर डिज़ाइन और टीम सहयोग की समझ को बढ़ाया।\n• एक महीने के लिए सफलता इंजीनियर के रूप में काम किया, जहाँ मैंने महत्वपूर्ण ग्राहक-सामना करने वाली समस्याओं को डीबग किया और संबोधित किया। इस भूमिका ने मेरे समस्या-समाधान कौशल और दबाव में प्रभावी रूप से डीबग करने की क्षमता को काफी सुधारा।"
    },
    "WFX_FTE": {
        "TITLE": "सॉफ्टवेयर इंजीनियर",
        "COMPANY": "व्हाटफिक्स FTE",
        "LOGO": "/whatfix-logo.png",
        "TECHSTACK": [
            "जावा",
            "टाइपस्क्रिप्ट",
            "नोड.जेएस",
            "ओपनएआई"
        ],
        "START_DATE": "जुलाई 2024",
        "END_DATE": "वर्तमान",
        "DESCRIPTION": "• व्हाटफिक्स उपयोगकर्ता अनुभव में संचार और परिवर्तन प्रबंधन क्षमताओं के विकास का नेतृत्व किया। विकास प्रक्रिया में शुरू से शामिल होना।\n• एक उन्नत क्लाइंट-साइड CRON की तरह काम करने वाली एक क्लाइंट-साइड स्केड्यूलर प्रक्रिया की वास्तुकला और विकास किया।\n• व्हाटफिक्स की अन्वेषणात्मक AI अनुसंधान परियोजनाओं में सक्रिय रूप से शामिल, विशेष रूप से पुनः प्राप्ति बढ़ाया जेनरेशन और उद्यम खोज पर काम कर रहा हूँ।"
    },
    "CLRFD_INTERN" : {
        "TITLE": "सॉफ्टवेयर इंजीनियर इंटर्न",
        "COMPANY": "क्लियरफीड",
        "LOGO": "/clearfeed-logo.jpeg",
        "TECHSTACK": [
            "टाइपस्क्रिप्ट",
            "नेक्स्टजेएस",
            "नेस्टजेएस",
            "सिक्वेलाइज",
            "पोस्टग्रेसक्यूएल"
        ],
        "START_DATE": "मई 2023",
        "END_DATE": "अगस्त 2023",
        "DESCRIPTION": "• बैकएंड और फ्रंटएंड घटकों को विकसित किया और उनमें योगदान दिया, जैसे कि Next.js, Nest.js, और Sequelize.js का उपयोग करते हुए फुल स्टैक डेवलपर के रूप में।\n• 50 से अधिक पुल रिक्वेस्ट को सफलतापूर्वक मर्ज किया, नई सुविधाओं के कार्यान्वयन को बढ़ावा दिया और महत्वपूर्ण बग्स को हल किया, जिससे मजबूत सहयोग और समस्या-समाधान कौशल का प्रदर्शन किया।\n• एक तेज-तर्रार इंटर्नशिप वातावरण में फला-फूला, साप्ताहिक उत्पादन रिलीज़ में सक्रिय रूप से भाग लिया, जिससे अनुकूलन क्षमता और कड़ी समय सीमा के तहत उच्च-गुणवत्ता वाले कोड की डिलीवरी का प्रदर्शन किया।"
    },
    "BYS_INTERN" : {
        "TITLE": "गीक-इन-रेजीडेंस, फुल स्टैक",
        "COMPANY": "बेसिस.एआई",
        "LOGO": "/Basys-White.webp",
        "TECHSTACK": [
            "रिएक्ट",
            "रिडक्स",
            "जावास्क्रिप्ट",
            "टेलविंडसीएसएस",
            "नोडजेएस",
            "एक्सप्रेसजेएस",
            "मोंगोडीबी",
            "गिट"
        ],
        "START_DATE": "अगस्त 2022",
        "END_DATE": "मार्च 2023",
        "DESCRIPTION": "• बेसिस.एआई के स्वास्थ्य प्रदाताओं और बीमा कंपनियों के लिए फ्लैगशिप वेब ऐप के विकास पर काम किया\n• ऐप के लिए पूर्ण प्रणाली और डेटाबेस स्कीमा डिज़ाइन को संभाला फ्रंटेंड और बैकेंड के साथ\n• संस्थापकों को सीधे रिपोर्ट करते हुए और सॉफ्टवेयर डिज़ाइन और विकास में हाथोंहाथ अनुभव प्राप्त किया\n• भारत के शीर्ष संस्थानों से आवेदन करने वाले 2860 उम्मीदवारों में से चयनित किया गया"
    },
    "BYT_INTERN" :{
        "TITLE": "फ्रंट-एंड डेवलपर इंटर्न",
        "COMPANY": "बाइटलर्न",
        "LOGO": "/bytelearn-LOGO.jpeg",
        "TECHSTACK": [
            "रिएक्ट",
            "टाइपस्क्रिप्ट",
            "एससीएसएस",
            "बिटबकेट",
            "जिरा",
            "गिट"
        ],
        "START_DATE": "जुलाई 2022",
        "END_DATE": "अगस्त 2022",
        "DESCRIPTION": "• रिएक्ट, टाइपस्क्रिप्ट और एससीएसएस का उपयोग करके मॉड्यूलर और पुन: प्रयोज्य रिएक्ट UI तत्वों को विकसित किया\n• जिरा, बिटबकेट, कॉन्फ्लुएंस और गिट जैसे उद्योग मानक सहयोग उपकरणों का उपयोग करते हुए टीम के साथ सहयोग करने में हाथोंहाथ अनुभव प्राप्त किया"
    }
}