{
    "HEADER": "Work Experience",
    "SKILLS_USED": "Skills Used",
    "WFX_INTERN": {
        "TITLE": "Software Engineer Intern",
        "COMPANY": "Whatfix Intern",
        "LOGO": "/whatfix-logo.png",
        "TECHSTACK": [
            "java",
            "typescript",
            "elastic-search",
            "cassandra",
            "openai",
            "hadoop"
        ],
        "START_DATE": "January 2024",
        "END_DATE": "June 2024",
        "DESCRIPTION": "• Designed and developed a robust UI testing framework from scratch for a hybrid desktop application. This node-based framework is capable of testing web, hybrid, and native desktop applications on both Mac and Windows platforms. I implemented thin interfaces to facilitate the reuse of test cases written in our TestNG-based Java program, ensuring seamless integration and efficient testing processes through solid IPC using REST and STDIN/OUT pipes.\n• Actively participated in software design discussions, contributing to the architectural planning for both my projects and those of other team members. This involvement enhanced my understanding of software design and team collaboration.\n• Worked as a Success Engineer for one month, where I debugged and addressed critical customer-facing issues. This role significantly improved my problem-solving skills and my ability to debug effectively under pressure."
    },
    "WFX_FTE": {
        "TITLE": "Software Engineer",
        "COMPANY": "Whatfix FTE",
        "LOGO": "/whatfix-logo.png",
        "TECHSTACK": [
            "java",
            "typescript",
            "node.js",
            "openai"
        ],
        "START_DATE": "July 2024",
        "END_DATE": "Present",
        "DESCRIPTION": "• Driving development of Communications and Change Management capabilities in whatfix end user experience. Involved in the development process from scratch.\n• Architected and developed a client-side scheduler process that acts like an advanced client-side CRON with extensive configurations.\n• Actively involved in Whatfix’s exploratory AI research projects, particularly working on retrieval augmented generation and enterprise search."
    },
    "CLRFD_INTERN" : {
        "TITLE": "Software Engineer Intern",
        "COMPANY": "ClearFeed",
        "LOGO": "/clearfeed-logo.jpeg",
        "TECHSTACK": [
            "typescript",
            "nextjs",
            "nestjs",
            "sequelize",
            "postgresql"
        ],
        "START_DATE": "May 2023",
        "END_DATE": "August 2023",
        "DESCRIPTION": "• Developed and contributed to both backend and frontend components as a full stack developer, utilizing technologies such as Next.js, Nest.js, and Sequelize.js\n• Successfully merged over 50 pull requests, driving the implementation of new features and resolving critical bugs, showcasing strong collaboration and problem-solving skills\n• Thrived in a fast-paced internship environment, actively participating in weekly production releases, demonstrating adaptability and delivering high-quality code under tight deadlines."
    },
    "BYS_INTERN" : {
        "TITLE": "Geek-in-Residence, Full Stack",
        "COMPANY": "Basys.ai",
        "LOGO": "/Basys-White.webp",
        "TECHSTACK": [
            "react",
            "redux",
            "javascript",
            "tailwindcss",
            "nodejs",
            "expressjs",
            "mongodb",
            "git"
        ],
        "START_DATE": "August 2022",
        "END_DATE": "March 2023",
        "DESCRIPTION": "• Worked on developing basys.ai's flagship web app for healthcare providers and insurance companies\n• Handled full system and database schema design for the app with frontend and backend\n• Reported directly to the founders and gaining hands on experience in software design and development\n• Selected from 2860 candidates that applied for the role from top institutes in India"
    },
    "BYT_INTERN" :{
        "TITLE": "Front-End Developer Intern",
        "COMPANY": "Bytelearn",
        "LOGO": "/bytelearn-LOGO.jpeg",
        "TECHSTACK": [
            "react",
            "typescript",
            "scss",
            "bitbucket",
            "jira",
            "git"
        ],
        "START_DATE": "July 2022",
        "END_DATE": "August 2022",
        "DESCRIPTION": "• Developed modular and reusable react UI elements using React, TypeScript and SCSS\n• Gained hands on experience in collaborating with a team and using industry standard collaboration tools like jira, bitbucket, confluence and git"
    }
}